{
	"homepage":"https://minecraft.curseforge.com/projects/immersiveposts",
	"promos":{
		"1.12.2-latest": "0.1.1",
		"1.12.2-recommended": "0.1.1"
	},
	"1.12.2":{
		"0.1.1": "- Changes -\n  Increased explosion resistance to 5.\n  IE-Manual Entries a little bit.\n  Increased contrast for almost all post textures.\n  Copper-post texture to give it the patina look.\n  Mini-arms now appear on the top most post block.\n  Mini-arms are now included into the selection boundry.\n  Clamped selection bounds for arms.\n\n- Fixes -\n  Fences connecting to posts and base.\n\nAt some point i'll make it so that fences and rod items only take up one block/item id. So far every fence uses it's own Block ID, same with Rods which is a waste of space.\nAnd to keep you guys from going insane with the updates, i'll leave it like this for now. Until then have fun!",
		"0.1.0": "This is a rather big one, with lots of new stuff being added.\nI highly recommend making a backup of your world befor loading it with this update!\n\n- Additions -\n10 new posts and matching fences (and rods to craft said fences) to use for extending. (See list below.)\n\n- Changes -\n\"improved\" pages for the IE Manual Category.\nAdded recipes for the fences mentioned above in the manual aswell.\n\n\n\n- List of post types. -\n  Constantan\n  Copper\n  Electrum\n  Gold\n  Iron\n  Lead\n  Nickel\n  Silver\n  Uranium\n  and Nether-Brick (Because why not)",
		"0.0.5": "- Changes -\nPost \"mini-arms\" now behave like the ones from IE.\n  As you'd expect them to.\nBeing a perfectionist with textures.\n  Aka got rid of what apeared to be Stretching when looking at the top-most blocks.\nSome more opimization, mostly with the way \"connections\" are checked for the arms.\n  It's now X amount of times faster. Yes, im not sure by how much.\n  But i definitely noticed less lag when placing blocks near posts. (I have a potato, so i notice that stuff fairly easily)",
		"0.0.4-01": "- Additions -\nIE Manual Entry\n\n- Changes -\nGeneraly optimizing a few things here and there.\n\n- Fixes -\nTooltip now displays correctly.\nMini-Arms now don't apear anymore when a multiblock structure from IE is next to it.\nMissing texture on the bottom side of the top post cap.\nCreative Tab now has the correct name.",
		"0.0.4": "Finaly added these mini-arm that apear on the posts themself. (When you attach for example a lever to them)\n\nSo now it's (technicaly) feature-complete.",
		"0.0.3": "- Changes -\nMade arms less.. fiddly. (I hope)\n\n- Fixes -\nItem model is finaly visible to the world!\n\nI know: Just for that?\nWhy?\nI planned to add something else too but it will take longer than i first thought.",
		"0.0.2": "- Additions -\nSetup update notification stuff. (Now whenever a new version is released you'll be notified in-game.)\nAdded recipe for the Extendable Post prematurely. (Mind that the item still doesnt display correctly!)\n\n- Changes -\nChanged versioning scheme to fit the update notfication stuff. (Starting with 0.0.2)\n\n- Fixes -\nRight-clicking an arm with a fence, and another arm being directly above it, won't spawn a post ontop of the second arm.\nRight-clicking an upside-down arm with a fence won't place a post above it.",
		"0.0.1.001": "- Fixes - \nArms now correctly display upside down when a block is below it.\nArms don't flip if a block is already above it.\nPost Top doesnt change to normal Post when an Arm is above it.\n\nNow requires ImmersiveEngineering 0.12 or Higher. (Instead of ImmersiveEngineering 0.12-8)",
		"0.0.1.000": "First test release."
	}
}
