{
	"homepage": "https://www.curseforge.com/minecraft/mc-mods/immersiveposts",
	"promos":{
		"1.21.1-latest": "4.3.1-13", "1.21.1-recommended": "4.3.1-13",
		"1.20.1-latest": "4.3.0-11", "1.20.1-recommended": "4.3.0-11",
		"1.19.3-latest": "4.3.0-9", "1.19.3-recommended": "4.3.0-9",
		"1.19.2-latest": "4.3.0-8", "1.19.2-recommended": "4.3.0-8",
		"1.18.2-latest": "4.3.0-3", "1.18.2-recommended": "4.3.0-3",
		"1.18.1-latest": "4.3.0-2", "1.18.1-recommended": "4.3.0-2",
		"1.16.5-latest": "4.3.0-1", "1.16.5-recommended": "4.3.0-1",
		"1.16.3-latest": "3.0.0", "1.16.3-recommended": "3.0.0",
		"1.15.2-latest": "2.2.0", "1.15.2-recommended": "2.2.0",
		"1.14.4-latest": "1.2.0", "1.14.4-recommended": "1.2.0",
		"1.12.2-latest": "0.2.1", "1.12.2-recommended": "0.2.1"
	},
	"1.21.1":{
		"4.3.1-13": "[F] Fixed manual issue with ImmersivePetroleum installed. (TwistedGate)",
		"4.3.1-12": "Compiled with\nNeoForge version: 1.21.1-21.1.164\nIE version: 1.21.1-12.4.2-194\n\n1.21.2 Port. (TwistedGate)"
	},
	"1.20.1":{
		"4.3.0-11": "[F] Fixed \"java.lang.NoSuchFieldError: CREATIVE_MODE_TAB\"\n[C] Reverted back to shift-holding for trusses",
		"4.3.0-10": "Compiled with\n\nForge version: 1.20.1-47.3.0\nIE version: 1.20.1-10.1.0-171\n\n[A] Ability to hang Lanterns from post-arms. (TwistedGate)\n[F] Double-Arm end retaining the flipped down state. (TwistedGate)"
	},
	"1.19.3":{
		"4.3.0-7": "[F] ClientEventHandler being loaded on Server-Side, resulting in a NoClassDefFoundError crash caused by BlockColor being Loaded.",
		"4.3.0-5": "Compiled with\n\nForge version: 1.19.3-44.1.5\nIE version: 1.19.3-9.3.0-163\n\nnInitial 1.19.3 Port. (TwistedGate)"
	},
	"1.19.2":{
		"4.3.0-6": "[F] ClientEventHandler being loaded on Server-Side, resulting in a NoClassDefFoundError crash caused by BlockColor being Loaded.",
		"4.3.0-4": "Compiled with\n\nForge version: 1.19.2-43.2.0\nIE version: 1.19.2-9.1.2-159\n\nnInitial 1.19.2 Port. (TwistedGate)"
	},
	"1.18.2": {
		"4.3.0-3": "Compiled with\nForge version: 1.18.2-40.0.12\nIE version: 1.18.2-8.0.0-146\n\nInitial 1.18.2 Port (malte0811)"
	},
	"1.18.1": {
		"4.3.0-2": "Compiled with\nForge version: 1.18.1-39.0.36\nIE version: 1.18.1-7.1.0-145\n\nInitial 1.18.1 Port\n[C] Removed PostBase Tooltip. (TwistedGate)\n[C] Manual Entry and Language File Changes. (TwistedGate)\n- Removed flavour text.\n- Removed dynamicly generated table and replaced it with a manualy written version. (Also removed the entries in en_us.json aswell.)\n- Index page entries are now clickable for faster navigation.\n- Switched from item display to recipe display. (As it used to be waaay back)\n- Moved Aluminum and Steel entry up, to be near Treated Wood, as they should be."
	},
	"1.16.5": {
		"4.3.0-1": "Compiled with\nForge version: 1.16.5-36.2.0\nIE version: 1.16.5-5.0.3-138\n\n[A] Added API to add custom Posts. (TwistedGate)\n[A] Added Korean Translation. (FreddyYJ)\n[F] ImmersivePosts actualy wanting the correct Forge and IE versions. (TwistedGate)\n[F] Fixed ImmersivePosts reporting the wrong version. (TwistedGate)\n\nWith ImmersivePosts having an API now the version scheme changed aswell!\nImmersivePosts-MinecraftVersion-ApiVersion-Release",
		"4.2.2": "[F] Fixed hotbar slot not being usable to get the cover off of the postbase again after the stack turned into an empty stack.\n[F] Fixed \"Missing Texture\" particles on hidden postbase. (Switched to using the postbase texture as default)\n[F] Fixed \"Unknown key \"x\" Tried deleting all configs and it didn't solve it.\"",
		"4.2.1": "This is a very small update with hopes of fixing this manual thing.\n\n[F] Fixed manual not loading with ImmersivePetroleum installed.",
		"4.2.0": "Forge version: 1.16.5-36.2.0\nIE version: 1.16.5-5.0.2-137\n\n[A] Added trusses to \"connect\" two posts together horizonaly.  (Check the How-To page in the Extendable Posts category)\n[C] Changed manual category name to \"Extendable Posts\" instead of mod name.\n[C] Textures got an overhaul.",
		"4.1.1": "IE version: 1.16.5-5.0.2-137\n\n[A] Added FrannDzs to Credits. (Spanish Language)\n[F] NoSuchMethodError crash related to Utils.hashBlockstate",
		"4.1.0": "Forge version: 1.16.5-36.1.0\n\nRequired update for to run with IEs breaking API changes with 1.16.5-5.0.0-135!",
		"4.0.0": "Forge version: 1.16.5-36.0.0\nIE version: 1.16.5-4.2.2-132\n\n[A] Loot Tables for Posts, PostBase and Fences. (Parker8283 & TwistedGate)\n[A] Added Spanish (es_es) language. (FrannDzs)\n[F] Manual text not being resolved from lang file in \"Accepted Blocks\" index pages. (Parker8283)\n[F] Fences not dropping themselves when broken. (Parker8283)"
	},
	"1.16.3": {
		"3.0.0": "Forge version: 1.16.3-34.0.7\nIE version: 1.16.3-4.0.1-121\n\n[A] Waterlogging for Posts, PostBase and Fences\n[A] Ability for the Base to use a block as cover\n"
	},
	"1.15.2":{
		"2.2.0": "[A] Waterlogging for Posts, PostBase and Fences\n[A] Ability for the Base to use a block as cover\n",
		"2.1.0": "[A] Config for removing unwanted posts. (Disables recipes and prevents them from being constructed in-world)\n[F] Ghost page between index tables in the manual.",
		"2.0.0": "Forge version: 1.15.2-31.2.0\nIE version: 0.15-103\n\nInitial 1.15.2 Port"
	},
	"1.14.4":{
		"1.2.0": "[A] Config for removing unwanted posts. (Disables recipes and prevents them from being constructed in-world)\n[F] Ghost page between index tables in the manual.",
		"1.1.0": "[C] 1-Block Arms can both Face Up & Down at the same time now.\n\nThis *may* break existing 1-Block Arms and will break 2-Block Arms thus a world-backup is recommended befor updating!",
		"1.0.1": "IE Version: 0.14-95\n\n[F] Posts and Postbase being washed away by Fluids.\n[F] Lighting bug.\n[F] Postbase not dropping itself.",
		"1.0.0-rev1_ie94": "Same as 1.0.0-rev1, just for IE 0.14-94. Since 95 was not officialy released at the time.",
		"1.0.0-rev1": "IE version: 0.14-95\n\n[F] Forgot to add the Generated Data",
		"1.0.0": "Forge version: 1.14.4-28.2.3\nFirst release for 1.14.4\n\n[R] Config for removing unwanted post types. (No point doing it)"
	},
	"1.12.2":{
		"0.2.1": "[F] 1-Block arms not connecting to bottom/top on server side.",
		"0.2.0": "[C] 1-Block Arms can both Face Up & Down at the same time now.\n\nThis *will* break existing Arms (both 1-Block and 2-Block wide) thus a world-backup is recommended befor updating!",
		"0.1.5": "Forge version: 1.12.2-14.23.5.2820\n\n[A] Config for removing unwanted posts types. [Use with Caution]",
		"0.1.4": "[A] 2-Wide Arm for Posts.\n[A] Chinese Translation. (scikirbypoke)\n[C] Semantic Corrections in Russian Translation. (Shellyoung)\n[C] PostBase Recipe. Now using Cobblestone instead of Cobblestone-Walls.\n[C] Manual Entries. Being more readable and adding some nice images aswell.\n[F] Collision for Mini-Arms won't cause trouble anymore.",
		"0.1.3": "Change of plan.\nWarning: Please backup your world!\n\n[A] Concrete and Leaded Concrete Post.\n[A] Ways to localize things.\n[A] Russian Localization. (Shellyoung)\n[F] Post directly above the Postbase thinking its also a postbase.\n[F] Possible typos.\n[C] Removed old Rod items and Re-added them using Metadata.\n[C] Index-Page is now twice as indexy.\n\nI may have forgotten some things, been a while.\nUse up all the rods you crafted (if any) or destroy/recycle them befor updating. Because they'll be gone and replaced by the new ones!\nSorry for being so chaotic with this. I should've done this at the start.",
		"0.1.2": "[C] Optimized BlockStates to only include things that actualy matter.\n[F] Arms always facing down after reloading world.\n\n\n- Important notice befor updating, please read! -\nThis update, provided i didnt mess up again, will be the last one with the items having each a different ID!\n\nAfter this the items will only use one ID instead. So whenever that update comes, either use up all the rods\nyou crafted or destroy/recycle them befor updating. Because they'll be gone! (And backup your world, just incase)\nAnd re-apear with another ID. (Using metadata this time)\n\nI'll update to it just befor i move over to 1.13 (Once IE has it's first release for that.)\n\nIf you read all this, thank you for your time. I hereby release you from this mess. :D",
		"0.1.1": "[C] Increased explosion resistance to 5.\n[C] IE-Manual Entries a little bit.\n[C] Increased contrast for almost all post textures.\n[C] Copper-post texture to give it the patina look.\n[C] Mini-arms now appear on the top most post block.\n[C] Mini-arms are now included into the selection boundry.\n[C] Clamped selection bounds for arms.\n[F] Fences connecting to posts and base.\n\nAt some point i'll make it so that fences and rod items only take up one block/item id. So far every fence uses it's own Block ID, same with Rods which is a waste of space.\nAnd to keep you guys from going insane with the updates, i'll leave it like this for now. Until then have fun!",
		"0.1.0": "This is a rather big one, with lots of new stuff being added.\nI highly recommend making a backup of your world befor loading it with this update!\n\n[A] 10 new posts and matching fences (and rods to craft said fences) to use for extending. (See list below.)\n[A] Recipes for the fences mentioned above in the manual aswell.\n[C] \"improved\" pages for the IE Manual Category.\n\n\n\n- List of post types. -\n  Constantan\n  Copper\n  Electrum\n  Gold\n  Iron\n  Lead\n  Nickel\n  Silver\n  Uranium\n  and Nether-Brick (Because why not)",
		"0.0.5": "[F] Being a perfectionist with textures.\n  Aka got rid of what apeared to be Stretching when looking at the top-most blocks.\n[C] Post \"mini-arms\" now behave like the ones from IE.\n  As you'd expect them to.\n[C] Some more opimization, mostly with the way \"connections\" are checked for the arms.\n  It's now X amount of times faster. Yes, im not sure by how much.\n  But i definitely noticed less lag when placing blocks near posts. (I have a potato, so i notice that stuff fairly easily)",
		"0.0.4-01": "[A] IE Manual Entry\n[C] Generaly optimizing a few things here and there.\n[F] Tooltip now displays correctly.\n[F] Mini-Arms now don't apear anymore when a multiblock structure from IE is next to it.\n[F] Missing texture on the bottom side of the top post cap.\n[F] Creative Tab now has the correct name.",
		"0.0.4": "Finaly added these mini-arm that apear on the posts themself. (When you attach for example a lever to them)\n\nSo now it's (technicaly) feature-complete.",
		"0.0.3": "[C] Made arms less.. fiddly. (I hope)\n\n[F] Item model is finaly visible to the world!\n\nI know: Just for that?\nWhy?\nI planned to add something else too but it will take longer than i first thought.",
		"0.0.2": "[A] Setup update notification stuff. (Now whenever a new version is released you'll be notified in-game.)\n[A] Recipe for the Extendable Post prematurely. (Mind that the item still doesnt display correctly!)\n[C] Versioning scheme to fit the update notfication stuff. (Starting with 0.0.2)\n[F] Right-clicking an arm with a fence, and another arm being directly above it, won't spawn a post ontop of the second arm.\n[F] Right-clicking an upside-down arm with a fence won't place a post above it.",
		"0.0.1.001": "[F] Arms now correctly display upside down when a block is below it.\n[F] Arms don't flip if a block is already above it.\n[F] Post Top doesnt change to normal Post when an Arm is above it.\n\nNow requires ImmersiveEngineering 0.12 or Higher. (Instead of ImmersiveEngineering 0.12-8)",
		"0.0.1.000": "First test release."
	}
}
